luckyCharm1123/STM32_LED/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "RED_LED.h"
/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */
/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */
#ifndef LORA_DEBUG_VERBOSE
#define LORA_DEBUG_VERBOSE 0
#endif

#if LORA_DEBUG_VERBOSE
#define LORA_DEBUG_LOG(msg) \
  do { \
    DEBUG_SendString((msg)); \
  } while(0)

#define LORA_DEBUG_CODE(code_block) \
  do { \
    code_block \
  } while(0)
#else
#define LORA_DEBUG_LOG(msg) \
  do { \
    /* Keep argument "used" and preserve type-checking without runtime side effects. */ \
    if(0) { \
      DEBUG_SendString((msg)); \
    } \
  } while(0)

#define LORA_DEBUG_CODE(code_block) \
  do { \
  } while(0)
#endif

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */
void DEBUG_SendString(const char *str);
void Get_STM32_UID(char *uid_str);  /* 获取STM32唯一ID */
void RELAY_On(void);                /* 打开继电器 */
void RELAY_Off(void);               /* 关闭继电器 */
void RELAY_Toggle(void);            /* 切换继电器状态 */
uint8_t RELAY_GetState(void);       /* 获取继电器状态 */
void RELAY2_On(void);               /* 打开继电器2 */
void RELAY2_Off(void);              /* 关闭继电器2 */
void RELAY2_Toggle(void);           /* 切换继电器2状态 */
uint8_t RELAY2_GetState(void);      /* 获取继电器2状态 */
/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
/* USER CODE BEGIN Private defines */
/* 用户代码开始：私有定义 */
/* 可以在此处添加自定义的常量和宏定义 */
#define RELAY_Pin GPIO_PIN_8
#define RELAY_GPIO_Port GPIOA
#define RELAY2_Pin GPIO_PIN_5
#define RELAY2_GPIO_Port GPIOA

#define GREEN_LED_Pin GPIO_PIN_0
#define GREEN_LED_GPIO_Port GPIOA
/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
